<template>
    <div class="mx-auto max-w-7xl px-6 lg:px-8">
        <div class="mx-auto max-w-4xl lg:mx-0">
          <h2 class="text-3xl font-bold tracking-tight text-gray-900 sm:text-4xl">Наша миссия</h2>
          <p class="mt-6 text-lg leading-8 text-gray-600">
            Мы — команда разработчиков института Телекоммуникаций и Информатики Туркменистана, преданная исследованию, сохранению и популяризации богатого культурного наследия Туркменистана через его национальные праздники. Наша цель — поделиться уникальными традициями и яркими моментами, которые делают эти праздники особенно значимыми для народа Туркменистана.
          </p>
        </div>
        <dl class="mx-auto mt-16 grid max-w-2xl grid-cols-1 gap-x-8 gap-y-16 text-base leading-7 sm:grid-cols-2 lg:mx-0 lg:max-w-none lg:grid-cols-3">
          <div v-for="value in values" :key="value.name">
            <dt class="font-semibold text-gray-900">{{ value.name }}</dt>
            <dd class="mt-1 text-gray-600">{{ value.description }}</dd>
          </div>
        </dl>
      </div>
</template>
<script setup>
const values = [
  {
    name: 'Сохранение культурного наследия',
    description:
      'Мы стремимся сохранить и передать богатство традиций, обычаев и истории национальных праздников Туркменистана, укореняясь в их культурном наследии. Это позволяет нам сохранять уникальные черты и традиции для будущих поколений.',
  },
  {
    name: 'Просвещение и понимание',
    description:
      'Мы верим, что знание о культуре других народов способствует глубокому взаимопониманию и уважению. Наша миссия - предоставить информацию, способствующую расширению культурного горизонта, позволяя нашим читателям более глубоко вникнуть в смысл и ценности национальных праздников Туркменистана.',
  },
  {
    name: 'Поддержка общины и содействие в развитии',
    description:
      'Мы активно поддерживаем общество, посвященное изучению и продвижению культуры Туркменистана. Помимо предоставления информации, мы содействуем развитию сообщества, предоставляя площадку для обмена идеями и опытом, способствуя развитию культурного сознания.',
  },
  {
    name: 'Вдохновение культурным взаимодействием',
    description:
      'Мы стремимся вдохновлять на культурное взаимодействие, подчеркивая уникальность и красоту традиций Туркменистана. Наша миссия — стимулировать диалог, способствующий обмену идеями и опытом между различными культурами, создавая мосты взаимопонимания в мире.',
  },
  {
    name: 'Продвижение туризма и международного сотрудничества',
    description:
      'Мы стремимся привлекать внимание культурного наследия Туркменистана через национальные праздники, способствуя развитию туризма и укреплению международных связей. Мы верим, что обмен культурным опытом способствует увеличению взаимопонимания и уважения между различными странами и народами.',
  },
  {
    name: 'Эмпауэрмент молодежи:',
    description:
      'Мы активно поддерживаем и вдохновляем молодежь для участия в изучении, сохранении и передаче культурного наследия Туркменистана. Наша миссия также включает в себя создание образовательных программ и инициатив, направленных на вовлечение молодежи в познание и ценение своей культурной истории.',
  },
]
</script>